ARMmbed/mbed-os/targets/TARGET_NXP/TARGET_MCUXpresso_MCUS/TARGET_MIMXRT1170/drivers/fsl_clock.c
/*
 * Copyright 2019-2020 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_clock.h"
#include "fsl_anatop.h"
#include "fsl_anatop_ai.h"
/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.clock"
#endif

/*******************************************************************************
 * Definitions
 ******************************************************************************/
/* To make full use of CM7 hardware FPU, use double instead of uint64_t in clock driver to
achieve better performance, it is depend on the IDE Floating point settings, if double precision is selected
in IDE, clock_64b_t will switch to double type automatically. only support IAR and MDK here */
#if __FPU_USED

#if ((defined(__ICCARM__)) || (defined(__GNUC__)))

#if (__ARMVFP__ >= __ARMFPV5__) && \
    (__ARM_FP == 0xE) /*0xe implies support for half, single and double precision operations*/
typedef double clock_64b_t;
#else
typedef uint64_t clock_64b_t;
#endif

#elif defined(__CC_ARM) || defined(__ARMCC_VERSION)

#if defined __TARGET_FPU_FPV5_D16
typedef double clock_64b_t;
#else
typedef uint64_t clock_64b_t;
#endif

#else
typedef uint64_t clock_64b_t;
#endif

#else
typedef uint64_t clock_64b_t;
#endif

/*******************************************************************************
 * Variables
 ******************************************************************************/

/*******************************************************************************
 * Prototypes
 ******************************************************************************/

/*******************************************************************************
 * Code
 ******************************************************************************/

#define ARM_PLL_DIV_SEL_MIN 104
#define ARM_PLL_DIV_SEL_MAX 208

void CLOCK_InitArmPll(const clock_arm_pll_config_t *config)
{
    assert((config->loopDivider <= ARM_PLL_DIV_SEL_MAX) && (config->loopDivider >= ARM_PLL_DIV_SEL_MIN));

    uint32_t reg;

    if ((ANADIG_PLL->PLL_ARM_CTRL & (ANADIG_PLL_PLL_ARM_CTRL_POWERUP_MASK)) &&
        ((ANADIG_PLL->PLL_ARM_CTRL & (ANADIG_PLL_PLL_ARM_CTRL_DIV_SELECT(config->loopDivider))) ==
         (ANADIG_PLL_PLL_ARM_CTRL_DIV_SELECT(config->loopDivider))) &&
        ((ANADIG_PLL->PLL_ARM_CTRL & (ANADIG_PLL_PLL_ARM_CTRL_POST_DIV_SEL(config->postDivider))) ==
         (ANADIG_PLL_PLL_ARM_CTRL_POST_DIV_SEL(config->postDivider))))
    {
        /* no need to reconfigure the PLL if all the configuration is the same */
        if (!(ANADIG_PLL->PLL_ARM_CTRL & ANADIG_PLL_PLL_ARM_CTRL_ENABLE_CLK_MASK))
        {
            ANADIG_PLL->PLL_ARM_CTRL |= ANADIG_PLL_PLL_ARM_CTRL_ENABLE_CLK_MASK;
        }
        if ((ANADIG_PLL->PLL_ARM_CTRL & ANADIG_PLL_PLL_ARM_CTRL_PLL_ARM_GATE_MASK))
        {
            ANADIG_PLL->PLL_ARM_CTRL &= ~ANADIG_PLL_PLL_ARM_CTRL_PLL_ARM_GATE_MASK;
        }
        return;
    }

    ANATOP_EnablePllLdo();

    reg = ANADIG_PLL->PLL_ARM_CTRL & (~ANADIG_PLL_PLL_ARM_CTRL_PLL_ARM_STABLE_MASK);
    if (reg & (ANADIG_PLL_PLL_ARM_CTRL_POWERUP_MASK | ANADIG_PLL_PLL_ARM_CTRL_ENABLE_CLK_MASK))
    {
        /* Power down the PLL. */
        reg &= ~(ANADIG_PLL_PLL_ARM_CTRL_POWERUP_MASK | ANADIG_PLL_PLL_ARM_CTRL_ENABLE_CLK_MASK);
        reg |= ANADIG_PLL_PLL_ARM_CTRL_PLL_ARM_GATE_MASK;
        ANADIG_PLL->PLL_ARM_CTRL = reg;
    }

    /* Set the configuration. */
    reg &= ~(ANADIG_PLL_PLL_ARM_CTRL_DIV_SELECT_MASK | ANADIG_PLL_PLL_ARM_CTRL_POST_DIV_SEL_MASK);
    reg |= (ANADIG_PLL_PLL_ARM_CTRL_DIV_SELECT(config->loopDivider) |
            ANADIG_PLL_PLL_ARM_CTRL_POST_DIV_SEL(config->postDivider)) |
           ANADIG_PLL_PLL_ARM_CTRL_PLL_ARM_GATE_MASK | ANADIG_PLL_PLL_ARM_CTRL_POWERUP_MASK;
    ANADIG_PLL->PLL_ARM_CTRL = reg;
    __DSB();
    __ISB();
    SDK_DelayAtLeastUs(30, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY);

    /* Wait for the PLL stable, */
    while (0U == (ANADIG_PLL->PLL_ARM_CTRL & ANADIG_PLL_PLL_ARM_CTRL_PLL_ARM_STABLE_MASK))
    {
    }

    /* Enable and ungate the clock. */
    reg |= ANADIG_PLL_PLL_ARM_CTRL_ENABLE_CLK_MASK;
    reg &= ~ANADIG_PLL_PLL_ARM_CTRL_PLL_ARM_GATE_MASK;
    ANADIG_PLL->PLL_ARM_CTRL = reg;
}

void CLOCK_DeinitArmPll(void)
{
    uint32_t reg = ANADIG_PLL->PLL_ARM_CTRL & (~ANADIG_PLL_PLL_ARM_CTRL_PLL_ARM_STABLE_MASK);

    reg &= ~(ANADIG_PLL_PLL_ARM_CTRL_POWERUP_MASK | ANADIG_PLL_PLL_ARM_CTRL_ENABLE_CLK_MASK);
    reg |= ANADIG_PLL_PLL_ARM_CTRL_PLL_ARM_GATE_MASK;
    ANADIG_PLL->PLL_ARM_CTRL = reg;
}

#define SYS_PLL2_DIV_SEL_MIN 54
#define SYS_PLL2_DIV_SEL_MAX 108
/* 528PLL */
void CLOCK_InitSysPll2(const clock_sys_pll_config_t *config)
{
    uint32_t reg;

    if ((ANADIG_PLL->PLL_528_CTRL & ANADIG_PLL_PLL_528_CTRL_POWERUP_MASK) &&
        ((ANADIG_PLL->PLL_528_MFN == config->mfn) && (ANADIG_PLL->PLL_528_MFI == config->mfi)))
    {
        /* no need to reconfigure the PLL if all the configuration is the same */
        if (!(ANADIG_PLL->PLL_528_CTRL & ANADIG_PLL_PLL_528_CTRL_ENABLE_CLK_MASK))
        {
            ANADIG_PLL->PLL_528_CTRL |= ANADIG_PLL_PLL_528_CTRL_ENABLE_CLK_MASK;
        }

        if ((ANADIG_PLL->PLL_528_CTRL & ANADIG_PLL_PLL_528_CTRL_PLL_528_GATE_MASK))
        {
            ANADIG_PLL->PLL_528_CTRL &= ~ANADIG_PLL_PLL_528_CTRL_PLL_528_GATE_MASK;
        }
        return;
    }

    ANATOP_EnablePllLdo();
    /* Gate all PFDs */
    ANADIG_PLL->PLL_528_PFD |=
        ANADIG_PLL_PLL_528_PFD_PFD0_DIV1_CLKGATE(1) | ANADIG_PLL_PLL_528_PFD_PFD1_DIV1_CLKGATE(1) |
        ANADIG_PLL_PLL_528_PFD_PFD2_DIV1_CLKGATE(1) | ANADIG_PLL_PLL_528_PFD_PFD3_DIV1_CLKGATE(1);

    reg = ANADIG_PLL->PLL_528_CTRL;
    if (reg & (ANADIG_PLL_PLL_528_CTRL_POWERUP_MASK | ANADIG_PLL_PLL_528_CTRL_ENABLE_CLK_MASK))
    {
        /* Power down the PLL. */
        reg &= ~(ANADIG_PLL_PLL_528_CTRL_POWERUP_MASK | ANADIG_PLL_PLL_528_CTRL_ENABLE_CLK_MASK);
        reg |= ANADIG_PLL_PLL_528_CTRL_PLL_528_GATE_MASK;
        ANADIG_PLL->PLL_528_CTRL = reg;
    }

    /* Config PLL */
    ANADIG_PLL->PLL_528_MFD = 0x0FFFFFFFUL;
    ANADIG_PLL->PLL_528_MFN = config->mfn;
    ANADIG_PLL->PLL_528_MFI = config->mfi;

    /* REG_EN = 1, GATE = 1, DIV_SEL = 0, POWERUP = 0 */
    reg = ANADIG_PLL_PLL_528_CTRL_PLL_REG_EN(1) | ANADIG_PLL_PLL_528_CTRL_PLL_528_GATE(1);
    ANADIG_PLL->PLL_528_CTRL = reg;
    /* Wait until LDO is stable */
    SDK_DelayAtLeastUs(30, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY);

    /* REG_EN = 1, GATE = 1, DIV_SEL = 0, POWERUP = 1, HOLDRING_OFF = 1 */
    reg |= ANADIG_PLL_PLL_528_CTRL_POWERUP(1) | ANADIG_PLL_PLL_528_CTRL_HOLD_RING_OFF_MASK;
    ANADIG_PLL->PLL_528_CTRL = reg;
    SDK_DelayAtLeastUs(250, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY);

    /* REG_EN = 1, GATE = 1, DIV_SEL = 0, POWERUP = 1, HOLDRING_OFF = 0 */
    reg &= ~ANADIG_PLL_PLL_528_CTRL_HOLD_RING_OFF_MASK;
    ANADIG_PLL->PLL_528_CTRL = reg;
    /* Wait for PLL stable */
    while (ANADIG_PLL_PLL_528_CTRL_PLL_528_STABLE_MASK !=
           (ANADIG_PLL->PLL_528_CTRL & ANADIG_PLL_PLL_528_CTRL_PLL_528_STABLE_MASK))
    {
    }

    /* REG_EN = 1, GATE = 1, DIV_SEL = 0, POWERUP = 1, HOLDRING_OFF = 0, CLK = 1*/
    reg |= ANADIG_PLL_PLL_528_CTRL_ENABLE_CLK_MASK;
    ANADIG_PLL->PLL_528_CTRL = reg;

    /* REG_EN = 1, GATE = 0, DIV_SEL = 0, POWERUP = 1, HOLDRING_OFF = 0, CLK = 1*/
    reg &= ~ANADIG_PLL_PLL_528_CTRL_PLL_528_GATE_MASK;
    ANADIG_PLL->PLL_528_CTRL = reg;
    ANADIG_PLL->PLL_528_PFD &=
        ~(ANADIG_PLL_PLL_528_PFD_PFD0_DIV1_CLKGATE(1) | ANADIG_PLL_PLL_528_PFD_PFD1_DIV1_CLKGATE(1) |
          ANADIG_PLL_PLL_528_PFD_PFD2_DIV1_CLKGATE(1) | ANADIG_PLL_PLL_528_PFD_PFD3_DIV1_CLKGATE(1));
}

void CLOCK_DeinitSysPll2(void)
{
    ANADIG_PLL->PLL_528_PFD |=
        ANADIG_PLL_PLL_528_PFD_PFD0_DIV1_CLKGATE(1) | ANADIG_PLL_PLL_528_PFD_PFD1_DIV1_CLKGATE(1) |
        ANADIG_PLL_PLL_528_PFD_PFD2_DIV1_CLKGATE(1) | ANADIG_PLL_PLL_528_PFD_PFD3_DIV1_CLKGATE(1);

