ARMmbed/mbed-os/targets/TARGET_NXP/TARGET_MCUXpresso_MCUS/TARGET_MIMXRT1170/drivers/fsl_clock.c
    ANADIG_PLL->PLL_528_CTRL |= ANADIG_PLL_PLL_528_CTRL_PLL_528_GATE_MASK;
    ANADIG_PLL->PLL_528_CTRL &= ~(ANADIG_PLL_PLL_528_CTRL_ENABLE_CLK_MASK | ANADIG_PLL_PLL_528_CTRL_POWERUP_MASK |
                                  ANADIG_PLL_PLL_528_CTRL_PLL_REG_EN_MASK);
}

#define PFD_FRAC_MIN 12
#define PFD_FRAC_MAX 35
void CLOCK_InitPfd(clock_pll_t pll, clock_pfd_t pfd, uint8_t frac)
{
    volatile uint32_t *pfdCtrl = 0, *pfdUpdate = 0, stable;

    assert(frac <= PFD_FRAC_MAX && frac >= PFD_FRAC_MIN);

    switch (pll)
    {
        case kCLOCK_PllSys2:
            pfdCtrl = &ANADIG_PLL->PLL_528_PFD;
            pfdUpdate = &ANADIG_PLL->PLL_528_UPDATE;
            break;
        case kCLOCK_PllSys3:
            pfdCtrl = &ANADIG_PLL->PLL_480_PFD;
            pfdUpdate = &ANADIG_PLL->PLL_480_UPDATE;
            break;
        default:
            assert(false);
            break;
    }
    stable = *pfdCtrl & (ANADIG_PLL_PLL_528_PFD_PFD0_STABLE_MASK << (8 * (uint32_t)pfd));
    *pfdCtrl |= (ANADIG_PLL_PLL_528_PFD_PFD0_DIV1_CLKGATE_MASK << (8 * (uint32_t)pfd));

    /* all pfds support to be updated on-the-fly after corresponding PLL is stable */
    *pfdCtrl &= ~(ANADIG_PLL_PLL_528_PFD_PFD0_FRAC_MASK << (8 * (uint32_t)pfd));
    *pfdCtrl |= (ANADIG_PLL_PLL_528_PFD_PFD0_FRAC(frac) << (8 * (uint32_t)pfd));

    *pfdUpdate ^= (ANADIG_PLL_PLL_528_UPDATE_PFD0_UPDATE_MASK << (uint32_t)pfd);
    *pfdCtrl &= ~(ANADIG_PLL_PLL_528_PFD_PFD0_DIV1_CLKGATE_MASK << (8 * (uint32_t)pfd));
    /* Wait for stablizing */
    while (stable == (*pfdCtrl & (ANADIG_PLL_PLL_528_PFD_PFD0_STABLE_MASK << (8 * (uint32_t)pfd))))
    {
    }
}

#ifndef GET_FREQ_FROM_OBS
uint32_t CLOCK_GetPfdFreq(clock_pll_t pll, clock_pfd_t pfd)
{
    uint32_t pllFreq = 0, frac = 0;
    assert((pll == kCLOCK_PllSys2) ||  (pll == kCLOCK_PllSys3));

    switch (pll)
    {
        case kCLOCK_PllSys2:
            frac = (ANADIG_PLL->PLL_528_PFD & (ANADIG_PLL_PLL_528_PFD_PFD0_FRAC_MASK << (8 * (uint32_t)pfd)));
            pllFreq = SYS_PLL2_FREQ;
            break;
        case kCLOCK_PllSys3:
            frac = (ANADIG_PLL->PLL_480_PFD & (ANADIG_PLL_PLL_480_PFD_PFD0_FRAC_MASK << (8 * (uint32_t)pfd)));
            pllFreq = SYS_PLL3_FREQ;
            break;
        default:
            assert(false);
            break;
    }

    frac = frac >> (8 * (uint32_t)pfd);
    assert((frac >= PFD_FRAC_MIN) && (frac <= PFD_FRAC_MAX));
    return (frac ? pllFreq / frac * 18 : 0);
}
#else
uint32_t CLOCK_GetPfdFreq(clock_pll_t pll, clock_pfd_t pfd)
{
    uint32_t freq = 0;
    assert((pll == kCLOCK_PllSys2) ||  (pll == kCLOCK_PllSys3));

    switch (pll)
    {
        case kCLOCK_PllSys2:
            /* PLL_528_PFD0 OBS index starts from 234 */
            freq = CLOCK_GetFreqFromObs(pfd + 234, 2);
            break;
        case kCLOCK_PllSys3:
            /* PLL_480_PFD0 OBS index starts from 241 */
            freq = CLOCK_GetFreqFromObs(pfd + 241, 2);
            break;
        default:
            assert(false);
    }
    return freq;
}
#endif

#define SYS_PLL3_DIV_SEL_MIN 54
#define SYS_PLL3_DIV_SEL_MAX 108
/* 480PLL */
void CLOCK_InitSysPll3(const clock_sys_pll3_config_t *config)
{
    uint32_t reg;

    if ((ANADIG_PLL->PLL_480_CTRL & ANADIG_PLL_PLL_480_CTRL_POWERUP_MASK) &&
        ((ANADIG_PLL->PLL_480_CTRL & ANADIG_PLL_PLL_480_CTRL_DIV_SELECT(config->divSelect)) ==
         ANADIG_PLL_PLL_480_CTRL_DIV_SELECT(config->divSelect)))
    {
        /* no need to reconfigure the PLL if all the configuration is the same */
        if (!(ANADIG_PLL->PLL_480_CTRL & ANADIG_PLL_PLL_480_CTRL_ENABLE_CLK_MASK))
        {
            ANADIG_PLL->PLL_480_CTRL |= ANADIG_PLL_PLL_480_CTRL_ENABLE_CLK_MASK;
        }

        if ((ANADIG_PLL->PLL_480_CTRL & ANADIG_PLL_PLL_480_CTRL_PLL_480_GATE_MASK))
        {
            ANADIG_PLL->PLL_480_CTRL &= ~ANADIG_PLL_PLL_480_CTRL_PLL_480_GATE_MASK;
        }
        return;
    }

    ANATOP_EnablePllLdo();

    /* Gate all PFDs */
    ANADIG_PLL->PLL_480_PFD |=
        ANADIG_PLL_PLL_480_PFD_PFD0_DIV1_CLKGATE(1) | ANADIG_PLL_PLL_480_PFD_PFD1_DIV1_CLKGATE(1) |
        ANADIG_PLL_PLL_480_PFD_PFD2_DIV1_CLKGATE(1) | ANADIG_PLL_PLL_480_PFD_PFD3_DIV1_CLKGATE(1);
    /*
     * 1. configure PLL registres
     * 2. Enable internal LDO
     * 3. Wati LDO stable
     * 4. Power up PLL, assert hold_ring_off (only needed for avpll)
     * 5. At half lock time, de-asserted hold_ring_off (only needed for avpll)
     * 6. Wait PLL lock
     * 7. Enable clock output, release pfd_gate
     */
    reg = ANADIG_PLL_PLL_480_CTRL_DIV_SELECT(config->divSelect) | ANADIG_PLL_PLL_480_CTRL_PLL_REG_EN(1) |
          ANADIG_PLL_PLL_480_CTRL_PLL_480_GATE(1);
    ANADIG_PLL->PLL_480_CTRL = reg;
    SDK_DelayAtLeastUs(30, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY);

    reg |= ANADIG_PLL_PLL_480_CTRL_POWERUP(1) | ANADIG_PLL_PLL_480_CTRL_HOLD_RING_OFF_MASK;
    ANADIG_PLL->PLL_480_CTRL = reg;
    SDK_DelayAtLeastUs(30, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY);

    reg &= ~ANADIG_PLL_PLL_480_CTRL_HOLD_RING_OFF_MASK;
    ANADIG_PLL->PLL_480_CTRL = reg;

    /* Wait for PLL stable */
    while (ANADIG_PLL_PLL_480_CTRL_PLL_480_STABLE_MASK !=
           (ANADIG_PLL->PLL_480_CTRL & ANADIG_PLL_PLL_480_CTRL_PLL_480_STABLE_MASK))
    {
    }

    reg |= ANADIG_PLL_PLL_480_CTRL_ENABLE_CLK(1) | ANADIG_PLL_PLL_480_CTRL_PLL_480_DIV2(1);
    ANADIG_PLL->PLL_480_CTRL = reg;

    reg &= ~ANADIG_PLL_PLL_480_CTRL_PLL_480_GATE_MASK;
    ANADIG_PLL->PLL_480_CTRL = reg;
}

void CLOCK_DeinitSysPll3(void)
{
}

void ANATOP_PllSetPower(anatop_ai_itf_t itf, bool enable)
{
    ANATOP_AI_Write(itf, enable ? 0x04 : 0x08, 0x4000 | (enable ? 0x2000 : 0));
}

void ANATOP_PllBypass(anatop_ai_itf_t itf, bool bypass)
{
    ANATOP_AI_Write(itf, bypass ? 0x04 : 0x08, 0x10000);
}

void ANATOP_PllEnablePllReg(anatop_ai_itf_t itf, bool enable)
{
    ANATOP_AI_Write(itf, enable ? 0x04 : 0x08, 0x400000);
}

void ANATOP_PllHoldRingOff(anatop_ai_itf_t itf, bool off)
{
    ANATOP_AI_Write(itf, off ? 0x04 : 0x08, 0x2000);
}

void ANATOP_PllToggleHoldRingOff(anatop_ai_itf_t itf, uint32_t delay_us)
{
    ANATOP_PllHoldRingOff(itf, true);
    SDK_DelayAtLeastUs(delay_us, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY);
    ANATOP_PllHoldRingOff(itf, false);
}

